In [154]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [85]:
train=pd.read_csv('titanictrain.csv')
test=pd.read_csv('titanictest.csv')

In [86]:
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [87]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [88]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [92]:
features=['Pclass','Sex','Age','SibSp','Fare']

In [93]:
X=train[features]

In [94]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
Pclass    891 non-null int64
Sex       891 non-null object
Age       714 non-null float64
SibSp     891 non-null int64
Fare      891 non-null float64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

In [97]:
y=train.Survived

In [98]:
X.head()

   Pclass     Sex   Age  SibSp     Fare
0       3    male  22.0      1   7.2500
1       1  female  38.0      1  71.2833
2       3  female  26.0      0   7.9250
3       1  female  35.0      1  53.1000
4       3    male  35.0      0   8.0500

In [155]:
X['Age']=X['Age'].fillna(int(X.Age.mean()))

In [102]:
X.head(10)

   Pclass     Sex   Age  SibSp     Fare
0       3    male  22.0      1   7.2500
1       1  female  38.0      1  71.2833
2       3  female  26.0      0   7.9250
3       1  female  35.0      1  53.1000
4       3    male  35.0      0   8.0500
5       3    male  29.0      0   8.4583
6       1    male  54.0      0  51.8625
7       3    male   2.0      3  21.0750
8       3  female  27.0      0  11.1333
9       2  female  14.0      1  30.0708

In [121]:
dummies=pd.get_dummies(X.Sex)

In [124]:
inputs=pd.concat([X,dummies],axis='columns')

In [126]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age  SibSp     Fare  female  male
0       3  22.0      1   7.2500       0     1
1       1  38.0      1  71.2833       1     0
2       3  26.0      0   7.9250       1     0
3       1  35.0      1  53.1000       1     0
4       3  35.0      0   8.0500       0     1

In [127]:
inputs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
Pclass    891 non-null int64
Age       891 non-null float64
SibSp     891 non-null int64
Fare      891 non-null float64
female    891 non-null uint8
male      891 non-null uint8
dtypes: float64(2), int64(2), uint8(2)
memory usage: 29.7 KB

In [128]:
from sklearn.model_selection import train_test_split
X_train,X_valid,y_train,y_valid=train_test_split(inputs,y,train_size=0.8,random_state=1)

In [129]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 301 to 37
Data columns (total 6 columns):
Pclass    712 non-null int64
Age       712 non-null float64
SibSp     712 non-null int64
Fare      712 non-null float64
female    712 non-null uint8
male      712 non-null uint8
dtypes: float64(2), int64(2), uint8(2)
memory usage: 29.2 KB

In [137]:
X_valid.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 179 entries, 862 to 448
Data columns (total 6 columns):
Pclass    179 non-null int64
Age       179 non-null float64
SibSp     179 non-null int64
Fare      179 non-null float64
female    179 non-null uint8
male      179 non-null uint8
dtypes: float64(2), int64(2), uint8(2)
memory usage: 7.3 KB

In [142]:
from sklearn.ensemble import RandomForestClassifier
random=RandomForestClassifier(n_estimators=45,max_depth=5,random_state=0)
random.fit(X_train,y_train)
random.score(X_valid,y_valid)

0.7932960893854749

In [156]:
from sklearn.linear_model import LogisticRegression
logistic=LogisticRegression()
logistic.fit(X_train,y_train)
logistic.score(X_valid,y_valid)

0.7932960893854749

In [144]:
from sklearn.tree import DecisionTreeClassifier
decision=DecisionTreeClassifier()
decision.fit(X_train,y_train)
decision.score(X_valid,y_valid)

0.770949720670391

In [146]:
from sklearn.naive_bayes import GaussianNB
gaussian=GaussianNB()
gaussian.fit(X_train,y_train)
gaussian.score(X_valid,y_valid)

0.776536312849162

# Predicting the test values using Random Forest

In [147]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [151]:
final_test=test[features]

In [152]:
final_test.isna().sum()

Pclass     0
Sex        0
Age       86
SibSp      0
Fare       1
dtype: int64

In [157]:
final_test['Age']=final_test['Age'].fillna(int(final_test.Age.mean()))
final_test['Fare']=final_test['Fare'].fillna(final_test.Fare.mean())

In [162]:
dummies1=pd.get_dummies(final_test.Sex)
dummies1.head()

   female  male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

In [164]:
final=pd.concat([final_test,dummies1],axis='columns')
final.head()

   Pclass     Sex   Age  SibSp     Fare  female  male
0       3    male  34.5      0   7.8292       0     1
1       3  female  47.0      1   7.0000       1     0
2       2    male  62.0      0   9.6875       0     1
3       3    male  27.0      0   8.6625       0     1
4       3  female  22.0      1  12.2875       1     0

In [165]:
final.drop('Sex',axis='columns',inplace=True)

In [166]:
final.head()

   Pclass   Age  SibSp     Fare  female  male
0       3  34.5      0   7.8292       0     1
1       3  47.0      1   7.0000       1     0
2       2  62.0      0   9.6875       0     1
3       3  27.0      0   8.6625       0     1
4       3  22.0      1  12.2875       1     0

In [167]:
yp=random.predict(final)
yp

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0])

In [168]:
output=pd.DataFrame({'PassengerId':test.PassengerId,'Survived':yp})
output.to_csv('my_submissions.csv',index=False)
print('Succesfully saved the submission file')

Succesfully saved the submission file